In [ ]:
# E-Commerce sales Data Analysis
This project analyzes an E-Commerce dataset to uncover sales trends,customer purchasing behaviour, product performance, 
and revenue distribution across time and region usind python. The analysis focuses on identifying high value customers,
best-selling products,seasonal patterns and factors impacting overall revenue performance.
# Tools used
-Pyhton
-Pandas
-SQL lite

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("dataset.csv", encoding="ISO-8859-1")
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [ ]:
## Dataset Overview
The dataset contains transactional data from an online retail store, where each
row represents a single product purchase within an invoice.

In [3]:
df.shape

(541909, 8)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [ ]:

### Key Attributes
- Invoice Number – Unique identifier for each transaction  
- Invoice Date – Date and time of purchase  
- Customer ID – Unique identifier for customers  
- Product Description – Item purchased  
- Quantity – Number of units sold  
- Unit Price – Price per unit  
- Country – Customer’s country

In [5]:
df.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [6]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

In [ ]:
## Data Cleaning & Preprocessing

The following steps were performed to ensure data quality and accuracy:

- Removed records with missing Customer IDs
- Removed transactions with negative or zero quantity
- Removed transactions with zero or negative unit price
- Converted InvoiceDate column to datetime format
- Created a Revenue column (Quantity × Unit Price)
- Extracted time-based features:
  - Year
  - Month
  - Month Name
  - Day of Week
  - Hour of Purchase

These steps helped eliminate invalid transactions and enabled time-based analysis.

In [7]:
df['InvoiceDate']=pd.to_datetime(df['InvoiceDate'])

In [8]:
df=df.dropna(subset=['CustomerID'])

In [9]:
df=df[(df['Quantity']>0) & (df['UnitPrice']>0)].copy()

In [10]:
df['Revenue']= df['Quantity'] * df['UnitPrice']

In [11]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Revenue
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

In [12]:
df.shape

(397884, 9)

In [13]:
df['InvoiceDate'].dtype

dtype('<M8[ns]')

In [14]:
df['InvoiceDate']=pd.to_datetime(df['InvoiceDate'], errors='coerce')

In [15]:
df['InvoiceDate'].dtype

dtype('<M8[ns]')

In [16]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country', 'Revenue'],
      dtype='object')

In [17]:
df['InvoiceDate'].dtype

dtype('<M8[ns]')

In [18]:
df['Year']=df['InvoiceDate'].dt.year
df['Month']=df['InvoiceDate'].dt.month
df['MonthName']=df['InvoiceDate'].dt.month_name()
df['day']=df['InvoiceDate'].dt.day
df['DayOfWeek']=df['InvoiceDate'].dt.day_name()

In [19]:
df[['InvoiceDate', 'Year','MonthName','DayOfWeek']].head()

          InvoiceDate  Year MonthName  DayOfWeek
0 2010-12-01 08:26:00  2010  December  Wednesday
1 2010-12-01 08:26:00  2010  December  Wednesday
2 2010-12-01 08:26:00  2010  December  Wednesday
3 2010-12-01 08:26:00  2010  December  Wednesday
4 2010-12-01 08:26:00  2010  December  Wednesday

In [ ]:
## Exploratory Data Analysis (EDA)

Exploratory analysis was conducted to understand sales patterns and customer behavior:

- Monthly revenue trends were analyzed to identify seasonality
- Revenue contribution by country was examined
- Top-selling and top-revenue-generating products were identified
- Customer purchase frequency and revenue contribution were analyzed
- Weekly sales patterns were studied

EDA helped uncover meaningful business insights from raw transactional data.

In [20]:
#Monthly sales
monthly_sales=(df.groupby(['Year','MonthName'])['Revenue'].sum().reset_index() )
monthly_sales.head()

   Year MonthName     Revenue
0  2010  December  572713.890
1  2011     April  469200.361
2  2011    August  645343.900
3  2011  December  518192.790
4  2011  February  447137.350

In [21]:
#Top 10 products by revenue
top_products=(df.groupby('Description')['Revenue'].sum().sort_values(ascending=False).head(10))
top_products

Description
PAPER CRAFT , LITTLE BIRDIE           168469.60
REGENCY CAKESTAND 3 TIER              142592.95
WHITE HANGING HEART T-LIGHT HOLDER    100448.15
JUMBO BAG RED RETROSPOT                85220.78
MEDIUM CERAMIC TOP STORAGE JAR         81416.73
POSTAGE                                77803.96
PARTY BUNTING                          68844.33
ASSORTED COLOUR BIRD ORNAMENT          56580.34
Manual                                 53779.93
RABBIT NIGHT LIGHT                     51346.20
Name: Revenue, dtype: float64

In [22]:
#Top 10 countries by revenue
top_countries=(df.groupby('Country')['Revenue'].sum().sort_values(ascending=False).head(10))
top_countries

Country
United Kingdom    7308391.554
Netherlands        285446.340
EIRE               265545.900
Germany            228867.140
France             209024.050
Australia          138521.310
Spain               61577.110
Switzerland         56443.950
Belgium             41196.340
Sweden              38378.330
Name: Revenue, dtype: float64

In [23]:
#Business Questions
#1 How is revenue Trending Overtime (monthly)?
monthly_revenue=(df.groupby(['Year','Month'])['Revenue'].sum().reset_index().sort_values(['Year','Month']))
monthly_revenue.head(10)

   Year  Month     Revenue
0  2010     12  572713.890
1  2011      1  569445.040
2  2011      2  447137.350
3  2011      3  595500.760
4  2011      4  469200.361
5  2011      5  678594.560
6  2011      6  661213.690
7  2011      7  600091.011
8  2011      8  645343.900
9  2011      9  952838.382

In [24]:
#2 Which products generate the most reveneue?
top_products=(df.groupby('Description')['Revenue'].sum().sort_values(ascending=False).head(10))
top_products

Description
PAPER CRAFT , LITTLE BIRDIE           168469.60
REGENCY CAKESTAND 3 TIER              142592.95
WHITE HANGING HEART T-LIGHT HOLDER    100448.15
JUMBO BAG RED RETROSPOT                85220.78
MEDIUM CERAMIC TOP STORAGE JAR         81416.73
POSTAGE                                77803.96
PARTY BUNTING                          68844.33
ASSORTED COLOUR BIRD ORNAMENT          56580.34
Manual                                 53779.93
RABBIT NIGHT LIGHT                     51346.20
Name: Revenue, dtype: float64

In [25]:
#3 Which countries contribute most to the sales?
top_countries=(df.groupby('Country')['Revenue'].sum().sort_values(ascending=False).head(10))
top_countries

Country
United Kingdom    7308391.554
Netherlands        285446.340
EIRE               265545.900
Germany            228867.140
France             209024.050
Australia          138521.310
Spain               61577.110
Switzerland         56443.950
Belgium             41196.340
Sweden              38378.330
Name: Revenue, dtype: float64

In [26]:
#4 Which days of the week have highest Sales?
weekday_sales=(df.groupby('DayOfWeek')['Revenue'].sum().sort_values(ascending=False))
weekday_sales

DayOfWeek
Thursday     1976859.070
Tuesday      1700634.631
Wednesday    1588336.170
Friday       1485917.401
Monday       1367146.411
Sunday        792514.221
Name: Revenue, dtype: float64

In [27]:
#5 Top customers by Revenue
top_customers=(df.groupby('CustomerID')['Revenue'].sum().sort_values(ascending=False).head(10))
top_customers

CustomerID
14646.0    280206.02
18102.0    259657.30
17450.0    194550.79
16446.0    168472.50
14911.0    143825.06
12415.0    124914.53
14156.0    117379.63
17511.0     91062.38
16029.0     81024.84
12346.0     77183.60
Name: Revenue, dtype: float64

In [28]:
final_df=df.copy()

In [29]:
final_df.to_csv("online_retail_cleaned.csv",index=False)

In [30]:
# SQL Connection
import sqlite3
conn=sqlite3.connect("online_retail.db")
final_df.to_sql("retail_sales",conn,if_exists="replace",index=False)

397884

In [31]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country', 'Revenue', 'Year', 'Month',
       'MonthName', 'day', 'DayOfWeek'],
      dtype='object')

In [32]:
list(df.columns)

['InvoiceNo',
 'StockCode',
 'Description',
 'Quantity',
 'InvoiceDate',
 'UnitPrice',
 'CustomerID',
 'Country',
 'Revenue',
 'Year',
 'Month',
 'MonthName',
 'day',
 'DayOfWeek']

In [33]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country', 'Revenue', 'Year', 'Month',
       'MonthName', 'day', 'DayOfWeek'],
      dtype='object')

In [34]:
final_df=df.copy()
final_df.to_sql("retail_sales",conn,if_exists="replace",index=False)

397884

In [35]:
pd.read_sql("PRAGMA table_info(retail_sales);",conn)

    cid         name       type  notnull dflt_value  pk
0     0    InvoiceNo       TEXT        0       None   0
1     1    StockCode       TEXT        0       None   0
2     2  Description       TEXT        0       None   0
3     3     Quantity    INTEGER        0       None   0
4     4  InvoiceDate  TIMESTAMP        0       None   0
5     5    UnitPrice       REAL        0       None   0
6     6   CustomerID       REAL        0       None   0
7     7      Country       TEXT        0       None   0
8     8      Revenue       REAL        0       None   0
9     9         Year    INTEGER        0       None   0
10   10        Month    INTEGER        0       None   0
11   11    MonthName       TEXT        0       None   0
12   12          day    INTEGER        0       None   0
13   13    DayOfWeek       TEXT        0       None   0

In [36]:
pd.read_sql("SELECT * FROM retail_sales LIMIT 5;", conn)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Revenue,Year,Month,MonthName,day,DayOfWeek
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30,2010,12,December,1,Wednesday
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010,12,December,1,Wednesday
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00,2010,12,December,1,Wednesday
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010,12,December,1,Wednesday
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010,12,December,1,Wednesday

In [37]:
#Total Revenue
pd.read_sql("SELECT SUM(Revenue) AS total_revenue FROM retail_sales;",conn)

   total_revenue
0    8911407.904

In [38]:
#Total Records
query="""SELECT COUNT(*) AS total_transactions FROM retail_sales;"""
pd.read_sql(query,conn)

   total_transactions
0              397884

In [39]:
#Total Number of Customers
query="""SELECT COUNT(DISTINCT CustomerID) AS total_customers FROM retail_sales;"""
pd.read_sql(query,conn)

   total_customers
0             4338

In [40]:
#Monthly Revenue Trend
query="""SELECT
         Year,
         Month,
         ROUND(SUM(Revenue),2) AS 
         monthly_revenue FROM retail_sales
         GROUP BY Year, Month
         ORDER BY Year, Month;"""
pd.read_sql(query,conn)

    Year  Month  monthly_revenue
0   2010     12        572713.89
1   2011      1        569445.04
2   2011      2        447137.35
3   2011      3        595500.76
4   2011      4        469200.36
5   2011      5        678594.56
6   2011      6        661213.69
7   2011      7        600091.01
8   2011      8        645343.90
9   2011      9        952838.38
10  2011     10       1039318.79
11  2011     11       1161817.38
12  2011     12        518192.79

In [41]:
#Best Month by Revenue

query="""SELECT
         Year,
         Month,
         ROUND(SUM(Revenue),2) AS 
         revenue FROM retail_sales
         GROUP BY Year, Month
         ORDER BY revenue DESC
         LIMIT 1;"""
pd.read_sql(query,conn)

   Year  Month     revenue
0  2011     11  1161817.38

In [42]:
#Revenue by day of the week
query="""SELECT
         DayOfWeek,
         ROUND(SUM(Revenue),2) AS 
         revenue FROM retail_sales
         GROUP BY DayOfweek
         ORDER BY revenue DESC;"""
pd.read_sql(query,conn)

   DayOfWeek     revenue
0   Thursday  1976859.07
1    Tuesday  1700634.63
2  Wednesday  1588336.17
3     Friday  1485917.40
4     Monday  1367146.41
5     Sunday   792514.22

In [43]:
#Top 10 products by revenue
query="""SELECT
         Description,
         ROUND(SUM(Revenue),2) AS 
         product_revenue FROM retail_sales
         GROUP BY Description
         ORDER BY product_revenue DESC
         LIMIT 10;"""
pd.read_sql(query,conn)

                          Description  product_revenue
0         PAPER CRAFT , LITTLE BIRDIE        168469.60
1            REGENCY CAKESTAND 3 TIER        142592.95
2  WHITE HANGING HEART T-LIGHT HOLDER        100448.15
3             JUMBO BAG RED RETROSPOT         85220.78
4      MEDIUM CERAMIC TOP STORAGE JAR         81416.73
5                             POSTAGE         77803.96
6                       PARTY BUNTING         68844.33
7       ASSORTED COLOUR BIRD ORNAMENT         56580.34
8                              Manual         53779.93
9                  RABBIT NIGHT LIGHT         51346.20

In [44]:
#Top 10 products by quantity sold
query="""SELECT
         Description,
         SUM(Quantity) AS total_quantity
          FROM retail_sales
         GROUP BY Description
         ORDER BY total_quantity DESC
         LIMIT 10;"""
pd.read_sql(query,conn)

                          Description  total_quantity
0         PAPER CRAFT , LITTLE BIRDIE           80995
1      MEDIUM CERAMIC TOP STORAGE JAR           77916
2   WORLD WAR 2 GLIDERS ASSTD DESIGNS           54415
3             JUMBO BAG RED RETROSPOT           46181
4  WHITE HANGING HEART T-LIGHT HOLDER           36725
5       ASSORTED COLOUR BIRD ORNAMENT           35362
6     PACK OF 72 RETROSPOT CAKE CASES           33693
7                      POPCORN HOLDER           30931
8                  RABBIT NIGHT LIGHT           27202
9             MINI PAINT SET VINTAGE            26076

In [45]:
#Country revenue
query="""
SELECT Country, 
ROUND(SUM(Revenue),2) AS country_revenue 
FROM retail_sales 
GROUP BY Country
ORDER BY country_revenue DESC
LIMIT 10;
"""
pd.read_sql(query,conn)

          Country  country_revenue
0  United Kingdom       7308391.55
1     Netherlands        285446.34
2            EIRE        265545.90
3         Germany        228867.14
4          France        209024.05
5       Australia        138521.31
6           Spain         61577.11
7     Switzerland         56443.95
8         Belgium         41196.34
9          Sweden         38378.33

In [46]:
#Top 5 non-UK countries
query="""SELECT
         Country,
         ROUND(SUM(Revenue),2) AS revenue
          FROM retail_sales
          WHERE Country <>'United Kingdom'
         GROUP BY Country
         ORDER BY revenue DESC
         LIMIT 5;"""
pd.read_sql(query,conn)

       Country    revenue
0  Netherlands  285446.34
1         EIRE  265545.90
2      Germany  228867.14
3       France  209024.05
4    Australia  138521.31

In [47]:
#Top 10 Customers by Revenue
query="""SELECT
         CustomerID,
         ROUND(SUM(Revenue),2) AS 
         customer_revenue FROM retail_sales
         GROUP BY CustomerID
         ORDER BY Customer_revenue DESC
         LIMIT 10;"""
pd.read_sql(query,conn)

   CustomerID  customer_revenue
0     14646.0         280206.02
1     18102.0         259657.30
2     17450.0         194550.79
3     16446.0         168472.50
4     14911.0         143825.06
5     12415.0         124914.53
6     14156.0         117379.63
7     17511.0          91062.38
8     16029.0          81024.84
9     12346.0          77183.60

In [48]:
#Average Revenue per Customer
query=""" SELECT 
       ROUND(AVG(customer_total),2) AS avg_revenue_per_customer
       FROM(
       SELECT CustomerID, SUM(Revenue) AS customer_total
       FROM retail_sales
       GROUP BY CustomerID);"""
pd.read_sql(query,conn)

   avg_revenue_per_customer
0                   2054.27

In [49]:
#Customers contributing top revenue 
query="""SELECT
         CustomerID,
         ROUND(SUM(Revenue),2) AS 
         revenue FROM retail_sales
         GROUP BY CustomerID
         ORDER BY revenue DESC
         LIMIT 20;"""
pd.read_sql(query,conn)

    CustomerID    revenue
0      14646.0  280206.02
1      18102.0  259657.30
2      17450.0  194550.79
3      16446.0  168472.50
4      14911.0  143825.06
5      12415.0  124914.53
6      14156.0  117379.63
7      17511.0   91062.38
8      16029.0   81024.84
9      12346.0   77183.60
10     16684.0   66653.56
11     14096.0   65164.79
12     13694.0   65039.62
13     15311.0   60767.90
14     13089.0   58825.83
15     17949.0   58510.48
16     15769.0   56252.72
17     15061.0   54534.14
18     14298.0   51527.30
19     14088.0   50491.81

In [50]:
#Monthly revenue growth
query="""SELECT
         Year,
         Month,
         ROUND(SUM(Revenue),2) AS 
         revenue FROM retail_sales
         GROUP BY Year, Month
         ORDER BY Year, Month;"""
pd.read_sql(query,conn)

    Year  Month     revenue
0   2010     12   572713.89
1   2011      1   569445.04
2   2011      2   447137.35
3   2011      3   595500.76
4   2011      4   469200.36
5   2011      5   678594.56
6   2011      6   661213.69
7   2011      7   600091.01
8   2011      8   645343.90
9   2011      9   952838.38
10  2011     10  1039318.79
11  2011     11  1161817.38
12  2011     12   518192.79

In [51]:
#High-value transactions
quesry="""SELECT * FROM retail_sales
        WHERE Revenue>1000
        ORDER BY Revenue DESC;"""
pd.read_sql(query,conn)

    Year  Month     revenue
0   2010     12   572713.89
1   2011      1   569445.04
2   2011      2   447137.35
3   2011      3   595500.76
4   2011      4   469200.36
5   2011      5   678594.56
6   2011      6   661213.69
7   2011      7   600091.01
8   2011      8   645343.90
9   2011      9   952838.38
10  2011     10  1039318.79
11  2011     11  1161817.38
12  2011     12   518192.79

In [52]:
final_df.to_csv("online_retail_powerbi.csv",index=False)

In [ ]:
## Key Business Insights

### 1. Revenue Concentration
A small percentage of customers contribute a large portion of total revenue,
indicating the presence of high-value customers.

### 2. Seasonal Sales Pattern
Sales show noticeable variation across months, with peak revenue observed during
specific periods, likely driven by seasonal or festive demand.

### 3. Product Performance
Some products sell in high volumes but generate relatively low revenue, while others
contribute significantly despite lower sales volume.

### 4. Geographic Distribution
The majority of revenue comes from a primary country, while other countries contribute
smaller but consistent sales, indicating potential for international expansion.

### 5. Weekday vs Weekend Sales
Weekday sales outperform weekend sales, suggesting customers are more active during
working days.

In [ ]:
## Conclusion

This analysis demonstrates how e-commerce transactional data can be transformed into
valuable business insights through data cleaning, feature engineering, and exploratory
analysis. The findings can support better decision-making in areas such as customer
retention, inventory planning, pricing strategy, and targeted marketing.